
#include "logo.h"
#include "vga.h"

#define _ VGA_CL_YELLOW
#define X VGA_CL_RED

// :BUG: gd 2007-03-05: got compiler errors:
// ~~~ Compiling logo.o from logo.c
// C:\DOCUME~1\GoniX\LOCALS~1\Temp/cc86aaaa.s: Assembler messages:
// C:\DOCUME~1\GoniX\LOCALS~1\Temp/cc86aaaa.s:4: Warning: alignment too large: 31 a
// ssumed
// C:\DOCUME~1\GoniX\LOCALS~1\Temp/cc86aaaa.s:140: Fatal error: cannot write to out
// put file
// make[1]: *** [logo.o] Error 1
/*
word_t gLogoImage[LOGO_HEIGHT][LOGO_WIDTH] = {
    {_, _, _, _, _, _, _, _, _, _, _, _, _, _, _},
    {_, X, X, X, _, X, _, _, _, X, _, X, X, X, _},
    {_, X, _, _, _, X, _, _, _, X, _, X, _, _, _},
    {_, X, _, _, _, _, X, _, X, _, _, X, _, _, _},
    {_, X, X, X, _, _, X, _, X, _, _, X, X, X, _},
    {_, X, _, _, _, _, X, X, X, _, _, X, _, _, _},
    {_, X, _, _, _, _, _, X, _, _, _, X, _, _, _},
    {_, X, X, X, _, _, _, X, _, _, _, X, X, X, _},
    {_, _, _, _, _, _, _, _, _, _, _, _, _, _, _},
};
*/

/*char* gpLogoBig    =
        "      _______         ______ ____\n"
        "     /     _/\\ __ ___/      \\    \\\n"
        "    /   __|  |/ / __ \\  /   / ___/\\\n"
        "   /   ___|    /  ___/ /   /_   /\\/\n"
        "  /______/\\\\___\\___/______/____/ /\n"
        "  \\______\\/ \\__\\\\__\\\\_____\\____\\/\n";

char* gpLogoBig2 =
        "     ;;::::    :       ::''                : ':\n"
        "    ;;:::   :         :                     ': :\n"
        "   :;;::  :          ::                       ':'\n"
        "   ;;::  :  :        :                          '':\n"
        "  ;;:: :            :                           :;,:\n"
        "  ;;::  :          ::                           ;[[[,:\n"
        " :;;::    :        :                            ;;[[[;':\n"
        " ;;:: : :         [::       : :                  ;[[[[;;[,\n"
        " ;::   :         [;;;:     : :,                   [[[[['[[;\n"
        " ;:: :          :M;;:       : :,[                  [[[[ [['\n"
        " ;:     :        \"[::        : ::[                  ;[' ;[\n"
        " ;:   :           \"[:         : ::[                 :'  :'\n"
        " :: :: :           \",           :::;[              :'  :;\n"
        " :   ::             ':          : :::;[          ::'  :;\n"
        "  ::  ;               :          : ::::;[:,,::;;I'   ;;\n"
        "   ;;:;: : :           :          :::::::: '\"\"' I[[;\"'\n"
        "    ;;;::     :         :          '::::'       ;\n"
        "     \";;;::  :   :       :\n"
        "       ;;;::    :   :     :                     ;\n";
  */

char* gpLogoBig =
        "ллпмллллпппплллллллллллллллллппппппллм лл\n"
        "лл п ммллллллммлплллллллпмммллллллмм п пл\n"
        "п мллллллллллллллмлллллмллллллллллллллм п\n"
        " ллллллллллллллллллллллллллллллллллллллл\n"
        "БлллллллллллллллллллллллллллллллллллллллБ\n"
        "лВлл ммпллллллллллллБлллВллллллллпмм лллл\n"
        " лпллммллллллллппмп   пмппВВВлллллммллпл\n"
        "  пм  ппппппп ммп ммлллмлмм ппппппп  мп\n"
        "АА   пп мммм ппллллллллллмлп мммм пп  ААА\n"
        "ВВАВВВ м    ммлллллллллллллл ммммм АА ВВВ\n"
        "ллВллллпллллллллллллБллллллллмлллп ВВАллл\n"
        "лллллллм плллллллллл ллллллллллп ААллВллл\n"
        "ллллллллБ лллллллллл лллллллллл БлВлллллл\n"
        "лллллллп млллллллллллллллллллллм пллллллл\n";
